LinkedFolderNEW/TrainSet53G34U3_2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          130;
        startFace       16904;
    }
    outlet
    {
        type            patch;
        nFaces          640;
        startFace       17034;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       17674;
    }
    topbottomsurface
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2482;
        startFace       17834;
    }
)

// ************************************************************************* //
